{
  "title": "Discover",    
  "about1": {
    "title": "Magnet DAO is the evolution of the reserve currency protocol. The DAO uses its protocol controlled value to reward token holders with market-beating yields. At the same time, it uses its treasury reserves to invest in and incubate innovative projects.",
    "text": [
      "Unlike first-generation reserve currency protocols, the goal of Magnet DAO isn’t just to grow its market cap. Instead, it uses its treasury assets to acquire and invest in high-quality crypto assets, effectively turning the DAO into an on-chain venture fund. Since all fees and value accrued from these assets is distributed directly to token holders, Magnet DAO creates exponential value for all its investors.", 
      "Magnet DAO is the next stage of the tried and tested reserve currency model. You get the same extraordinary yields you’re familiar with. You also get exposure to opportunities rarely available to individual investors - ",
      "all through a single token."
    ]
  },
  "about2": {
    "title": "Magnet DAO ($MAG) is our native governance token which will be used to govern the DAO. The DAO will have voting power for major protocol decisions and treasury management.",
    "text": ["$MAG is launching natively on Avalanche (AVAX) and will be available for swapping on Trader Joe. We plan to expand to cross-chain in the future."]
  },
  "banner": {
    "text1": "Magnet DAO ($MAG) is our native governance token which will be used to govern the DAO. The DAO will have voting power for major protocol decisions and treasury management. ",
    "text2": "$MAG is launching natively on Avalanche (AVAX) and will be available for swapping on Trader Joe. We plan to expand to cross-chain in the future.",
    "items": {
      "name": {
        "title": "NAME", 
        "text": "Magnet DAO"
      },
      "symbol": {
        "title": "SYMBOL",
        "text": "MAG"
      },
      "contract": {
        "title": "CONTRACT",
        "text": "TBD"
      },
      "circulating": {
        "title": "CIRCULATING SUPPLY",
        "text": "750,000"
      },
      "chain": {
        "title":"CHAIN",
        "text": "Avalanche (AVAX)"
      },
      "totalSupply": {
        "title": "TOTAL SUPPLY",
        "text": "1,000,000 MAG"
      }
    }
    
  }
}