{
  "title": "FAQ",
  "magnetDao": {
    "title": "Magnet DAO - Specific FAQ",
    "questions": {
      "q1": {
        "q": "Are you forking OHM?",
        "a": {
          "text1": "Yes, we are forking OHM; however; we are implementing a unique strategy for the treasury. We want our protocol controlled value “PCV” to have more depth than simply representing a floor price / treasury for our token. OHM created something incredible with PCV, and we want to take it to the next level."
        }
      },
      "q2": {
        "q": "What is the Innovation Fund and how will it work?",
        "a": {
          "text1": "10% of bonded assets will be directed to an Innovation Fund which will be used to incubate and invest in new, disruptive projects. Magnet DAO will be highly involved, helping ideate projects and helping founders build their projects from the earliest stages. The Innovation Fund will also be used to invest projects that are further along but have yet to launch their token, giving token holders early exposure to projects they otherwise wouldn’t be able to invest in.",
          "text2": "Our network effect, community engagement, and synergies will allow us to build and scale projects quickly and efficiently; while providing investors with an unparalleled opportunity to invest in early-stage crypto projects."
        }
      },
      "q3": {
        "q": "What do you think the vetting process of these start up projects will look like?",
        "a": {
          "text1": "The core team & DAO leadership will actively perform due diligence on the projects. We have a robust team, including those with early-stage investing experience, marketing, product management, design and engineering. This will all go into vetting the projects that we consider investing in. Additionally, any use of funds we make from the treasury will be voted on by the DAO (token holders). DAO leadership will present their findings to the rest of the DAO and then hold a vote."
        }
      },
      "q4": {
        "q": "What measures are you considering to use for mitigating risk when choosing projects to use the Innovation fund?",
        "a": {
          "text1": "The projects we invest in will likely be later stage, closer to their launch, so those inherently are less risky and we will be able to see community, traction, and product.",
          "text2": "For earlier projects that are less proven, we plan on having a very active relationship with those teams, helping them incubate and grow. We even envision ourselves having developers reach out to us telling us that they want to build something, and us providing them with an idea and infrastructure to start. Our team comes from a variety of backgrounds, including crypto venture capital investing, blockchain development, product management, and marketing. Additionally, the DAO will vote and ultimately be the arbiter of any decision made by the Innovation Fund."
        }
      },
      "q5": {
        "q": "What can you do to assure the community that this is not a rugpull?",
        "a": {
          "text1": "The code will be open source and we have a number of community members who will be peer auditing it. We will also get multiple, tier 1 third-party audits for our token contract and our smart contracts prior to launching the protocol. All of our contracts and wallets will be multi-sig, with signatories consisting of core team members, third-party advisors (advisors TBD), and DAO leadership. Liquidity providing will also be locked, and team tokens locked and vested - we will post both contracts so the community can view these easily."
        }
      },
      "q7": {
        "q": "What chain are you launching on?",
        "a": {
          "text1": "Avalanche."
        }
      },
      "q8": {
        "q": "What are the networks you first had in mind when branching out?",
        "a": {
          "text1": "At first, the focus will likely be around AVAX projects. We are extremely bullish on AVAX and its ecosystem and have gotten some incredible support / partnerships, so naturally we will be very active there. Mid/long-term, we definitely plan on getting involved with other chains."
        }
      },
      "q9": {
        "q": "What are you doing to innovate?",
        "a": {
          "text1": "We have a lot of ideas for how we can add value to the protocol. A few protocol design ideas we have discussed:",
          "text2": "- Implement vesting schedules for bonds, where the user can receive a higher ROI if they opt to vest their tokens over a longer period of time (rather than 5 day standard)",
          "text3": "- Implement a diamond hands bonus for staking, to incentivize (🧲,🧲)",
          "text4": "- Add “zapping” liquidity to our protocol for ease of bonding LP pairs",
          "text5": "- Generate yield on our stablecoins. Given the amount of stablecoins we will have in our treasury, we will certainly be exploring how we can best generate return on these assets",
          "text6": "- Develop protocols under the Magnet DAO name. We already have various ideas for projects we want to develop, all of which are synergistic to our primary protocol"

        }
      }
    }
  },
  "ohmDao": {
    "title": "Olympus DAO - Related FAQ",
    "aside": "Please Note: Magnet DAO's source code stems from forking Olympus DAO, with some tweaks to treasury management. The bonding mechanism, staking rewards, and game theory concepts still apply - read here for more info on how our protocol differs from Olympus.",
    "questions": {
      "q1": {
        "q": "Why do we need MagnetDAO in the first place?",
        "a": {
          "text1": "Being less volatile than tokens like Bitcoin and Ether, dollar-pegged stablecoins have become an important aspect of the crypto world. Users are comfortable transacting with stablecoins because they know they will have the same purchasing power today as they will tomorrow. This, however, is a fallacy. The US government and the Federal Reserve are in charge of the currency. This means that if the dollar falls in value, so will these stablecoins. MagnetDAO intends to address this by developing $MAG, a free-floating reserve money backed by a portfolio of assets. MagnetDAO expects that by focusing on supply expansion rather than price appreciation, $MAG may serve as a stable currency."
        }
      },
      "q2": {
        "q": "Is MAG a stable coin?",
        "a": {
          "text1": "No, $MAG isn't a stablecoin. Rather, $MAG seeks to be a decentralized algorithmic reserve currency. $MAG, like the gold standard, offers its users with free floating value that they can always rely on, thanks to the fractional treasury reserves from which $MAG derives its intrinsic worth."
        }
      },
      "q3": {
        "q": "$MAG is backed, not pegged.",
        "a": {
          "text1": "MagnetDAO's protocol managed treasury, protocol owned liquidity (POL), bond mechanism, and staking rewards are all meant to keep supply expansion under control. The protocol makes money from bond sales, and the treasury uses the money to mint $MAG and distribute them to stakers. The protocol can accumulate its own liquidity by using liquidity bonds. Take a look at the entry below for further information on the importance of POL."
        }
      },
      "q4": {
        "q": "What is the deal with (🧲,🧲) and (❗, ❗)?",
        "a": {
          "text1": "(🧲,🧲) is the belief that if everyone in Magnet worked together, everyone would benefit the most (from a game theory standpoint). A user can currently take one of three actions:",
          "text2": "Staking (+2)\nBonding (+1)\nSelling (-2)",
          "text3": "Staking and bonding are thought to be advantageous to the procedure, whereas selling is thought to be harmful. Bonding does not produce a price change, whereas staking and selling do (we consider buying $MAG from the market as a prerequisite of staking, thus causing a price move). If both acts are advantageous, the actor who moves the price receives half of the profit (+1). If both acts are incompatible, the bad actor who moves the price receives half of the benefit (+1), while the good actor who moves the price receives half of the disadvantage (-1). (-1). If both activities are harmful, which suggests that both actors are selling, they will each receive half of the negative consequences (-1).",
          "text4": "As a result, given two actors, all possible scenarios for what they could do and their impact on the protocol are displayed here:",
          "text5": "It is beneficial for both of us and the protocol (3 + 3 = 6) if we both stake (3, 3).",
          "text6": "It's also ideal if one of us stakes and the other bonds, because staking removes $MAG from the market and places it in the protocol, while bonding offers liquidity and DAI for the Treasury (3 + 1 = 4).",
          "text7": "When one of us sells, the other who stakes or bonds puts in less effort (1 - 1 = 0).",
          "text8": "When both of us sell, it results in the worst possible outcome for both of us and for the protocol (-3 - 3 = -6)."
        }
      },
      "q5": {
        "q": "Why is PCV important?",
        "a": {
          "text1": "$MAG can only be minted or burned by the protocol because it is in charge of the assets in its treasury. This ensures that the protocol can always back 1 $MAG with a single DAI. Because you can be confident that the protocol will buy $MAG below 1 DAI indefinitely with treasury assets until no one is left to sell, you can easily quantify the risk of your investment. The FED is untrustworthy, but the code is reliable.",
          "text2": "More runway for the stakers is ensured as the procedure accumulates more PCV. Because more funds are available in the Treasury, stakers can be confident that the current staking APY will be sustained for a longer time."
        }
      },
      "q6": {
        "q": "Why is POL important?",
        "a": {
          "text1": "Because of its bond mechanism, Magnet owns the majority of its liquidity. This has a number of advantages:",
          "text2": "Magnet does not need to pay out large farming rewards to entice liquidity providers, often known as renting of liquidity. Magnet assures the market that liquidity will always be available to allow the sale or purchase of goods. Because it is the largest LP (liquidity provider), it receives the majority of the LP fees, which is an additional source of revenue for the Treasury. $MAG can be backed up with any POL. For this aim, the LP tokens are discounted to their risk-free value."
        }
      },
      "q7": {
        "q": "What is the point of buying $MAG when it is trading at a premium?",
        "a": {
          "text1": "When you buy and stake $MAG, you are capturing a percentage of the supply (market cap) that is expected to remain stable. This is due to the fact that your staked $MAG balance rises in tandem with the circulating supply. The consequence is that if you acquire $MAG when the market capitalization is low, you will be able to capture a higher portion of the market capitalization. Additionally, $MAG is adding value much further than just its treasury. We are building, incubating, and investing in projects. When you invest in $MAG, you are not just investing in a value-creation mechanism, you are also getting exposure to ground-level development of a multitude of innovative protocols."
        }
      },
      "q8": {
        "q": "What is a rebase?",
        "a": {
          "text1": "Rebase is a method that automatically enhances your staked $MAG balance. When the protocol creates fresh $MAG, a big chunk of it goes to the stakers. Because stakers can only see their staked $MAG balance and not their $MAG balance, the protocol uses the rebase technique to boost the staked $MAG balance so that 1 staked $MAG is always redeemable for 1 $MAG."
        }
      },
      "q9": {
        "q": "What is reward yield?",
        "a": {
          "text1": "The percentage by which your staked $MAG balance increases on the next epoch is known as reward yield. It's sometimes referred to as the rebase rate. This number can be found on the Magnet staking page."
        }
      },
      "q10": {
        "q": "What is APY?",
        "a": {
          "text1": "Annual percentage yield is abbreviated as APY. It considers the effect of compounding interest to calculate the real rate of return on your principal. In the case of MagnetDAO, your staked $MAG symbolizes your principal, while the rebase process adds compound interest every epoch (~8 hours).",
          "text2": "One unique feature of APY is that your balance will grow exponentially rather than linearly over time! If you start with a balance of 1 $MAG on day 1, and assume a daily compound interest rate of 2%, your balance will rise to around 1377 after a year. Not too bad!"
        }
      },
      "q11": {
        "q": "How is the APY calculated?",
        "a": {
          "text1": "The following calculation is used to determine the APY from the reward yield (also known as the rebase rate):",
          "text2": "APY = (1 + reward yield)^1095",
          "text3": "Because a rebase occurs three times per day, it rises to the power of 1095. Given that there are 365 days in a year, the rebase frequency would be 365 * 3 = 1095.",
          "text4": "The following equation determines the reward yield:",
          "text5": "Reward Yield = $MAG distributed / $MAG total staked",
          "text6": "Using the following calculation, the number of $MAG delivered to the staking contract is determined from the entire supply of $MAG:",
          "text7": "$MAG distributed = $MAG total supply x Reward rate",
          "text8": "**Please keep in mind that the protocol's reward rate is subject to change."
        }
      },
      "q12": {
        "q": "Why does the price of $MAG become irrelevant in the long-term?",
        "a": {
          "text1": "Because of the strength of compounding, your $MAG balance will grow dramatically over time, as seen above. Let's imagine you buy a $MAG for $400 today and the market determines that the intrinsic worth of the $MAG will be $2 in a year. If you assume a daily compound interest rate of 2%, your balance by the end of the year will be roughly 1377 $MAGs, which is worth around $2754. That's a profit of $2354! You should now realize that you are paying a higher price for $MAG now in exchange for a long-term advantage. As a result, you'll need a long time horizon to allow your $MAG balance to increase rapidly and make this an investment worth it."
        }
      },
      "q13": {
        "q": "What will be $MAG's intrinsic value in the future",
        "a": {
          "text1": "There is no clear answer, however treasury performance can be used to determine intrinsic value. For instance, if the Treasury can guarantee that every $MAG will be backed by 100 DAI, the intrinsic value of the $MAG will be 100 DAI. The DAO can also make a decision. If the DAO decides to raise the price floor of $MAG, for example, its intrinsic value will rise as well. $MAG will also benefit from the projects it launches, incubates, and invests in - which will all contribute to building its treasury, and fee streams should drive valuation."
        }
      },
      "q14": {
        "q": "How does the protocol manage to maintain the high staking APY?",
        "a": {
          "text1": "Assume the protocol aims for a 100,000 percent APY. This would imply a rebase rate of around 0.6328 percent, or a daily growth rate of around 2%. Please see the calculation above to see how the rebase rate is used to determine APY.",
          "text2": "To achieve this daily increase, the protocol would need to mint an additional 2000 $MAG if there are 100,000 $MAG staked right now. This can be accomplished if the protocol can generate at least 2000 DAI every day via bond sales. The APY of 100,000 percent cannot be guaranteed if the protocol fails to reach this."
        }
      },
      "q15": {
        "q": "Do I have to unstake and stake $MAG on every epoch to get my rebase rewards?",
        "a": {
          "text1": "No. Your staked $MAG balance will auto-compound every epoch once you've staked $MAG with MagnetDAO. Your rebase benefits are represented by that gain in balance."
        }
      },
      "q16": {
        "q": "How do I track my rebase rewards?",
        "a": {
          "text1": "You can track your rebase rewards by calculating the increase in your staked $MAG balance.",
          "text2": "Record down the Current Index value on the staking page when you first stake your $MAG. Let's call this the Start Index.",
          "text3": "After staking for some time, if you want to determine by how much your balance has increased, check the Current Index value again. Let's call this the End Index.",
          "text4": "By dividing the End Index by Start Index, you would get the ratio by which your staked $MAG balance has increased."
        }
      }
    }
  }
}